{"示例接口规范": 697, "api": 35, "spec": 299, "背景": 713, "这是一个虚构的": 748, "知识库问答服务": 695, "接口规范": 578, "用于测试": 679, "rag": 245, "里对接口文档的检索能力": 756, "文档入库接口": 586, "post": 208, "v1": 335, "ingest": 155, "content": 81, "type": 327, "application": 37, "json": 166, "request": 263, "collection": 74, "default": 90, "source": 293, "manual": 178, "documents": 101, "doc_id": 96, "intro": 162, "text": 301, "faq": 123, "response": 271, "ok": 198, "true": 323, "ingested_docs": 160, "chunks": 70, "37": 4, "检索接口": 626, "retrieve": 277, "query": 240, "示例接口规范 api": 698, "api spec": 36, "spec 背景": 300, "背景 这是一个虚构的": 714, "这是一个虚构的 知识库问答服务": 749, "知识库问答服务 接口规范": 696, "接口规范 用于测试": 579, "用于测试 rag": 680, "rag 里对接口文档的检索能力": 258, "里对接口文档的检索能力 文档入库接口": 757, "文档入库接口 post": 587, "post v1": 209, "v1 ingest": 337, "ingest content": 156, "content type": 82, "type application": 328, "application json": 38, "json request": 169, "request json": 264, "json collection": 167, "collection default": 75, "default source": 93, "source manual": 296, "manual documents": 179, "documents doc_id": 102, "doc_id intro": 98, "intro text": 164, "text doc_id": 302, "doc_id faq": 97, "faq text": 126, "text response": 303, "response json": 272, "json ok": 168, "ok true": 199, "true collection": 325, "default ingested_docs": 91, "ingested_docs chunks": 161, "chunks 37": 71, "37 检索接口": 5, "检索接口 post": 627, "v1 retrieve": 338, "retrieve content": 278, "default query": 92, "nt": 196, "怎么排查检索不到": 544, "top_k": 313, "results": 273, "chunk_id": 62, "score": 284, "82": 24, "76": 18, "问答接口": 765, "ask": 39, "为什么能减少胡说": 374, "max_tokens": 184, "512": 16, "nt type": 197, "query 怎么排查检索不到": 244, "怎么排查检索不到 top_k": 545, "top_k response": 315, "true top_k": 326, "top_k results": 316, "results doc_id": 274, "faq chunk_id": 124, "chunk_id score": 64, "score 82": 286, "82 text": 25, "intro chunk_id": 163, "score 76": 285, "76 text": 19, "text 问答接口": 304, "问答接口 rag": 766, "rag post": 246, "v1 ask": 336, "ask content": 40, "query rag": 242, "rag 为什么能减少胡说": 249, "为什么能减少胡说 top_k": 375, "top_k max_tokens": 314, "max_tokens 512": 185, "512 response": 17, "ery": 113, "answer": 33, "citations": 72, "错误码": 763, "4001": 6, "参数缺失": 437, "为空或": 378, "非法": 779, "5002": 12, "索引不存在": 707, "或索引文件损坏": 554, "5003": 14, "模型不可用": 634, "embedding": 103, "llm": 174, "加载失败": 424, "ery rag": 114, "true answer": 324, "answer citations": 34, "citations doc_id": 73, "chunk_id doc_id": 63, "chunk_id 错误码": 66, "错误码 4001": 764, "4001 参数缺失": 7, "参数缺失 query": 438, "query 为空或": 243, "为空或 top_k": 379, "top_k 非法": 320, "非法 5002": 780, "5002 索引不存在": 13, "索引不存在 ingest": 708, "ingest 或索引文件损坏": 158, "或索引文件损坏 5003": 555, "5003 模型不可用": 15, "模型不可用 embedding": 635, "embedding llm": 105, "llm 加载失败": 175, "simple": 291, "常见问题": 530, "q1": 230, "为什么我问的问题明明在文档里": 370, "但检索不到": 382, "文档切分导致": 588, "关键句被切到两段里": 414, "单段语义不完整": 427, "文档里用的是同义词": 594, "你提问用的是另一个说法": 394, "向量不一定能对齐": 460, "太小": 479, "相关段落排在第": 693, "或第": 552, "你只取了前": 390, "模型不适合": 636, "英文模型对中文效果一般": 717, "可换中文或多语模型": 451, "文档没入库": 592, "你忘了重新运行": 392, "q2": 232, "为什么检索结果看起来相关": 372, "但答案还是不对": 384, "生成": 675, "部分需要明确约束": 752, "要求": 719, "只根据给定资料回答": 441, "无法回答就说不知道": 598, "如果上下文里有冲突内容": 485, "模型可能挑错": 642, "需要": 775, "rerank": 265, "或规则优先级": 558, "q3": 234, "一定能防止胡说吗": 352, "不能": 360, "只是降低概率": 439, "检索错了": 632, "上下文错": 358, "模型会": 638, "认真地胡说": 729, "检索对了但上下文太长": 624, "模型可能忽略关键句": 640, "所以要做": 560, "评估": 737, "去噪": 435, "重排": 760, "提示词约束": 580, "引用证据": 540, "q4": 236, "chunk_size": 67, "设多少合适": 735, "先用": 410, "500": 10, "字符": 491, "overlap": 200, "80": 20, "simple rag": 292, "rag 常见问题": 254, "常见问题 faq": 531, "faq q1": 125, "q1 为什么我问的问题明明在文档里": 231, "为什么我问的问题明明在文档里 但检索不到": 371, "但检索不到 文档切分导致": 383, "文档切分导致 关键句被切到两段里": 589, "关键句被切到两段里 单段语义不完整": 415, "单段语义不完整 文档里用的是同义词": 428, "文档里用的是同义词 你提问用的是另一个说法": 595, "你提问用的是另一个说法 向量不一定能对齐": 395, "向量不一定能对齐 top_k": 461, "top_k 太小": 318, "太小 相关段落排在第": 481, "相关段落排在第 或第": 694, "或第 你只取了前": 553, "你只取了前 embedding": 391, "embedding 模型不适合": 109, "模型不适合 英文模型对中文效果一般": 637, "英文模型对中文效果一般 可换中文或多语模型": 718, "可换中文或多语模型 文档没入库": 452, "文档没入库 你忘了重新运行": 593, "你忘了重新运行 ingest": 393, "ingest q2": 157, "q2 为什么检索结果看起来相关": 233, "为什么检索结果看起来相关 但答案还是不对": 373, "但答案还是不对 rag": 385, "rag 生成": 256, "生成 部分需要明确约束": 676, "部分需要明确约束 要求": 753, "要求 只根据给定资料回答": 720, "只根据给定资料回答 无法回答就说不知道": 442, "无法回答就说不知道 如果上下文里有冲突内容": 599, "如果上下文里有冲突内容 模型可能挑错": 486, "模型可能挑错 需要": 643, "需要 rerank": 776, "rerank 或规则优先级": 268, "或规则优先级 q3": 559, "q3 rag": 235, "rag 一定能防止胡说吗": 248, "一定能防止胡说吗 不能": 353, "不能 rag": 361, "rag 只是降低概率": 250, "只是降低概率 检索错了": 440, "检索错了 上下文错": 633, "上下文错 模型会": 359, "模型会 认真地胡说": 639, "认真地胡说 检索对了但上下文太长": 730, "检索对了但上下文太长 模型可能忽略关键句": 625, "模型可能忽略关键句 所以要做": 641, "所以要做 评估": 561, "评估 去噪": 738, "去噪 重排": 436, "重排 提示词约束": 762, "提示词约束 引用证据": 581, "引用证据 q4": 541, "q4 chunk_size": 237, "chunk_size 设多少合适": 69, "设多少合适 先用": 736, "先用 500": 411, "500 字符": 11, "字符 overlap": 492, "overlap 80": 202, "如果你的文档结构明显": 487, "标题": 612, "段落": 648, "可以按段落切更好": 449, "技术文档常用按": 566, "作为": 386, "chunk": 51, "单位": 425, "q5": 238, "向量检索和关键词检索哪个更好": 464, "关键词": 416, "bm25": 45, "擅长精确匹配": 584, "如错误码": 489, "接口名": 576, "版本号": 661, "向量擅长语义相似": 462, "怎么排查连接失败": 546, "等表达差异": 701, "实战通常混合": 501, "向量": 458, "然后": 657, "80 如果你的文档结构明显": 21, "如果你的文档结构明显 标题": 488, "标题 段落": 613, "段落 可以按段落切更好": 650, "可以按段落切更好 技术文档常用按": 450, "技术文档常用按 标题": 567, "段落 作为": 649, "作为 chunk": 387, "chunk 单位": 56, "单位 q5": 426, "q5 向量检索和关键词检索哪个更好": 239, "向量检索和关键词检索哪个更好 关键词": 465, "关键词 bm25": 417, "bm25 擅长精确匹配": 48, "擅长精确匹配 如错误码": 585, "如错误码 接口名": 490, "接口名 版本号": 577, "版本号 向量擅长语义相似": 662, "向量擅长语义相似 怎么排查连接失败": 463, "怎么排查连接失败 等表达差异": 547, "等表达差异 实战通常混合": 702, "实战通常混合 bm25": 502, "bm25 向量": 47, "向量 然后": 459, "然后 rerank": 658, "术语表": 610, "glossary": 140, "retrieval": 275, "augmented": 41, "generation": 135, "一种": 354, "先检索": 408, "再生成": 418, "的问答范式": 687, "核心思想": 614, "把外部文档检索出来作为上下文": 568, "让模型基于上下文回答": 731, "向量表示": 468, "把文本映射成固定维度的向量": 570, "相似文本在向量空间里距离更近": 691, "切分片段": 420, "将长文档拆成较短的片段": 519, "便于向量化和检索": 400, "需要平衡": 777, "太大": 476, "vs": 345, "vector": 339, "index": 152, "向量索引": 466, "用于加速最近邻检索": 677, "ann": 29, "常见实现": 526, "faiss": 117, "hnsw": 144, "annoy": 31, "scann": 280, "top": 307, "检索时返回相似度最高的": 628, "个片段": 368, "的候选结果上用更强但更慢的模型重新排序": 681, "提高最终命中率": 582, "mmr": 188, "maximal": 186, "marginal": 180, "relevance": 259, "在相关性和多样性之间平衡": 470, "避免": 750, "全是相似片段": 412, "hallucination": 142, "幻觉": 532, "胡说": 715, "模型输出看似合理但没有依据或错误的内容": 646, "可降低但不能消灭": 455, "术语表 glossary": 611, "glossary rag": 141, "rag retrieval": 247, "retrieval augmented": 276, "augmented generation": 42, "generation 一种": 136, "一种 先检索": 355, "先检索 再生成": 409, "再生成 的问答范式": 419, "的问答范式 核心思想": 688, "核心思想 把外部文档检索出来作为上下文": 615, "把外部文档检索出来作为上下文 让模型基于上下文回答": 569, "让模型基于上下文回答 embedding": 732, "embedding 向量表示": 107, "向量表示 把文本映射成固定维度的向量": 469, "把文本映射成固定维度的向量 相似文本在向量空间里距离更近": 571, "相似文本在向量空间里距离更近 chunk": 692, "chunk 切分片段": 55, "切分片段 将长文档拆成较短的片段": 421, "将长文档拆成较短的片段 便于向量化和检索": 520, "便于向量化和检索 需要平衡": 401, "需要平衡 太大": 778, "太大 vs": 477, "vs 太小": 346, "太小 vector": 480, "vector index": 340, "index 向量索引": 154, "向量索引 用于加速最近邻检索": 467, "用于加速最近邻检索 ann": 678, "ann 常见实现": 30, "常见实现 faiss": 527, "faiss hnsw": 119, "hnsw annoy": 145, "annoy scann": 32, "scann top": 281, "top 检索时返回相似度最高的": 310, "检索时返回相似度最高的 个片段": 629, "个片段 rerank": 369, "rerank 重排": 270, "重排 top": 761, "top 的候选结果上用更强但更慢的模型重新排序": 312, "的候选结果上用更强但更慢的模型重新排序 提高最终命中率": 682, "提高最终命中率 mmr": 583, "mmr maximal": 189, "maximal marginal": 187, "marginal relevance": 181, "relevance 在相关性和多样性之间平衡": 260, "在相关性和多样性之间平衡 避免": 471, "避免 top": 751, "top 全是相似片段": 308, "全是相似片段 hallucination": 413, "hallucination 幻觉": 143, "幻觉 胡说": 533, "胡说 模型输出看似合理但没有依据或错误的内容": 716, "模型输出看似合理但没有依据或错误的内容 rag": 647, "rag 可降低但不能消灭": 252, "学习项目资料": 495, "本项目目标": 608, "理解": 673, "检索增强生成": 622, "的基本流程": 685, "将文档切分成": 515, "做向量化": 406, "建立向量索引": 534, "对用户问题做向量化并检索最相关的": 511, "将检索结果作为上下文交给大模型生成答案": 517, "为什么要做": 376, "纯大模型回答容易": 709, "编造": 711, "尤其遇到训练数据里没有的内容": 522, "可以把": 447, "外部知识": 472, "你的文档": 396, "手册": 562, "业务规则": 366, "实时提供给模型": 503, "降低胡说概率": 773, "更容易更新": 600, "文档更新后重新入库即可": 590, "最小实现": 606, "mvp": 192, "只需要做到": 445, "读取": 741, "docs": 99, "保存": 402, "输入": 745, "检索": 618, "generate": 133, "片段拼成上下文": 659, "第一版可以不接大模型": 699, "常见误区": 528, "检索命中率下降": 620, "且上下文冗长": 364, "rag 学习项目资料": 253, "学习项目资料 intro": 496, "intro 本项目目标": 165, "本项目目标 理解": 609, "理解 rag": 674, "generation 检索增强生成": 137, "检索增强生成 的基本流程": 623, "的基本流程 将文档切分成": 686, "将文档切分成 chunk": 516, "chunk chunk": 52, "chunk 做向量化": 54, "做向量化 embedding": 407, "embedding 建立向量索引": 108, "建立向量索引 对用户问题做向量化并检索最相关的": 535, "对用户问题做向量化并检索最相关的 chunk": 512, "chunk 将检索结果作为上下文交给大模型生成答案": 60, "将检索结果作为上下文交给大模型生成答案 为什么要做": 518, "为什么要做 rag": 377, "rag 纯大模型回答容易": 257, "纯大模型回答容易 编造": 710, "编造 尤其遇到训练数据里没有的内容": 712, "尤其遇到训练数据里没有的内容 rag": 523, "rag 可以把": 251, "可以把 外部知识": 448, "外部知识 你的文档": 473, "你的文档 手册": 397, "手册 业务规则": 563, "业务规则 实时提供给模型": 367, "实时提供给模型 降低胡说概率": 504, "降低胡说概率 rag": 774, "rag 更容易更新": 255, "更容易更新 文档更新后重新入库即可": 601, "文档更新后重新入库即可 最小实现": 591, "最小实现 mvp": 607, "mvp 只需要做到": 193, "只需要做到 ingest": 446, "ingest 读取": 159, "读取 docs": 742, "docs chunk": 100, "chunk embedding": 53, "embedding index": 104, "index 保存": 153, "保存 retrieve": 403, "retrieve 输入": 279, "输入 query": 746, "query embedding": 241, "embedding top": 106, "top 检索": 309, "检索 generate": 619, "generate top": 134, "top 片段拼成上下文": 311, "片段拼成上下文 第一版可以不接大模型": 660, "第一版可以不接大模型 常见误区": 700, "常见误区 chunk": 529, "chunk 太大": 58, "太大 检索命中率下降": 478, "检索命中率下降 且上下文冗长": 621, "且上下文冗长 chunk": 365, "语义不完整": 739, "模型看不懂": 644, "只用向量检索": 443, "对数字": 505, "专有名词": 362, "精确匹配不稳定": 705, "后续可加入": 456, "建议的调参方向": 536, "300": 2, "800": 22, "50": 8, "150": 0, "对检索结果做去重": 509, "交叉编码器": 380, "小型重排模型": 521, "chunk 太小": 59, "太小 语义不完整": 482, "语义不完整 模型看不懂": 740, "模型看不懂 只用向量检索": 645, "只用向量检索 对数字": 444, "对数字 专有名词": 506, "专有名词 精确匹配不稳定": 363, "精确匹配不稳定 后续可加入": 706, "后续可加入 bm25": 457, "bm25 rerank": 46, "rerank 建议的调参方向": 267, "建议的调参方向 chunk_size": 537, "chunk_size 300": 68, "300 800": 3, "800 字符": 23, "overlap 50": 201, "50 150": 9, "150 top_k": 1, "top_k 对检索结果做去重": 319, "对检索结果做去重 mmr": 510, "mmr rerank": 190, "rerank 交叉编码器": 266, "交叉编码器 小型重排模型": 381, "排障手册": 574, "troubleshooting": 321, "问题": 767, "powershell": 210, "里激活": 758, "venv": 341, "失败": 483, "现象": 669, "bin": 43, "activate": 26, "报错": 572, "找不到": 564, "原因": 429, "mac": 176, "linux": 170, "的命令": 683, "要用": 721, "ps1": 223, "解决": 723, "set": 289, "executionpolicy": 115, "scope": 282, "currentuser": 88, "remotesigned": 261, "scripts": 287, "pip": 204, "安装依赖时出现": 499, "proxyerror": 220, "cannot": 49, "connect": 79, "to": 305, "proxy": 215, "filenotfounderror": 127, "配置或环境变量设置了无效代理": 754, "常见于代理软件卸载残留": 524, "config": 76, "list": 172, "检查是否有": 616, "unset": 331, "global": 138, "user": 333, "清理": 655, "http_proxy": 148, "https_proxy": 150, "环境变量": 665, "排障手册 troubleshooting": 575, "troubleshooting 问题": 322, "问题 powershell": 769, "powershell 里激活": 212, "里激活 venv": 759, "venv 失败": 344, "失败 现象": 484, "现象 输入": 672, "输入 source": 747, "source venv": 297, "venv bin": 342, "bin activate": 44, "activate 报错": 28, "报错 找不到": 573, "找不到 source": 565, "source 原因": 298, "原因 source": 434, "source mac": 295, "mac linux": 177, "linux 的命令": 171, "的命令 powershell": 684, "powershell 要用": 211, "要用 activate": 722, "activate ps1": 27, "ps1 解决": 224, "解决 set": 726, "set executionpolicy": 290, "executionpolicy scope": 116, "scope currentuser": 283, "currentuser remotesigned": 89, "remotesigned venv": 262, "venv scripts": 343, "scripts activate": 288, "ps1 问题": 225, "问题 pip": 768, "pip 安装依赖时出现": 206, "安装依赖时出现 proxyerror": 500, "proxyerror 现象": 222, "现象 proxyerror": 671, "proxyerror cannot": 221, "cannot connect": 50, "connect to": 80, "to proxy": 306, "proxy filenotfounderror": 216, "filenotfounderror 原因": 128, "原因 pip": 431, "pip 配置或环境变量设置了无效代理": 207, "配置或环境变量设置了无效代理 常见于代理软件卸载残留": 755, "常见于代理软件卸载残留 解决": 525, "解决 pip": 725, "pip config": 205, "config list": 77, "list 检查是否有": 173, "检查是否有 proxy": 617, "proxy pip": 217, "config unset": 78, "unset global": 332, "global proxy": 139, "proxy user": 218, "user proxy": 334, "proxy 清理": 219, "清理 http_proxy": 656, "http_proxy https_proxy": 149, "https_proxy 环境变量": 151, "windows": 347, "安装": 497, "cpu": 83, "error": 111, "no": 194, "matching": 182, "distribution": 94, "found": 131, "for": 129, "pypi": 226, "可能没有匹配你": 453, "python": 228, "版本的": 663, "轮子": 743, "hnswlib": 146, "替代": 602, "作为向量索引": 388, "学习原理足够": 493, "或改用": 548, "wsl": 350, "ubuntu": 329, "环境安装": 667, "检索结果重复": 630, "相似": 689, "太多": 474, "导致相邻": 513, "高度重复": 781, "做去重": 404, "例如基于": 398, "或相似度阈值": 550, "引入": 538, "最大边际相关性": 604, "前做多样性选择": 422, "答案引用资料但仍然偏题": 703, "prompt": 213, "没约束": 653, "上下文噪声大": 356, "或者检索错了": 556, "让模型必须引用片段编号": 733, "无法从资料得出结论就说不知道": 596, "环境变量 问题": 666, "问题 windows": 770, "windows 安装": 349, "安装 faiss": 498, "faiss cpu": 118, "cpu 失败": 85, "现象 error": 670, "error no": 112, "no matching": 195, "matching distribution": 183, "distribution found": 95, "found for": 132, "for faiss": 130, "cpu 原因": 84, "原因 pypi": 433, "pypi windows": 227, "windows 可能没有匹配你": 348, "可能没有匹配你 python": 454, "python 版本的": 229, "版本的 faiss": 664, "faiss 轮子": 121, "轮子 解决": 744, "解决 hnswlib": 724, "hnswlib 替代": 147, "替代 faiss": 603, "faiss 作为向量索引": 120, "作为向量索引 学习原理足够": 389, "学习原理足够 或改用": 494, "或改用 wsl": 549, "wsl ubuntu": 351, "ubuntu 环境安装": 330, "环境安装 faiss": 668, "faiss 问题": 122, "问题 检索结果重复": 771, "检索结果重复 相似": 631, "相似 chunk": 690, "chunk 太多": 57, "太多 原因": 475, "原因 overlap": 430, "overlap 导致相邻": 203, "导致相邻 chunk": 514, "chunk 高度重复": 61, "高度重复 解决": 782, "解决 做去重": 727, "做去重 例如基于": 405, "例如基于 source": 399, "source chunk_id": 294, "chunk_id 或相似度阈值": 65, "或相似度阈值 引入": 551, "引入 mmr": 539, "mmr 最大边际相关性": 191, "最大边际相关性 top_k": 605, "top_k 前做多样性选择": 317, "前做多样性选择 问题": 423, "问题 答案引用资料但仍然偏题": 772, "答案引用资料但仍然偏题 原因": 704, "原因 prompt": 432, "prompt 没约束": 214, "没约束 上下文噪声大": 654, "上下文噪声大 或者检索错了": 357, "或者检索错了 解决": 557, "解决 让模型必须引用片段编号": 728, "让模型必须引用片段编号 无法从资料得出结论就说不知道": 734, "引用资料但仍然偏题": 542, "对检索结果": 507, "比如": 651, "cross": 86, "encoder": 110, "引用资料但仍然偏题 原因": 543, "无法从资料得出结论就说不知道 对检索结果": 597, "对检索结果 rerank": 508, "rerank 比如": 269, "比如 cross": 652, "cross encoder": 87}